cf_billing/DataProcessors/энргПерерасчетМенеджер.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>энргПерерасчетМенеджер</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

cf_billing/AccumulationRegisters/энргНачисленныйСреднийОбъем.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>энргНачисленныйСреднийОбъем</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ОбъемУслуги</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>6</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОбъемУслугиПотери</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>6</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОбъемУслугиПотребленный</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>6</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОбъемУслугиПотребленныйПотери</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>6</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.энргОперацияСУслугами</v8:Type>
						<v8:Type>cfg:DocumentRef.энргОперацияСЛицевымСчетом</v8:Type>
						<v8:Type>cfg:DocumentRef.энргРасходныйКассовыйОрдер</v8:Type>
						<v8:Type>cfg:DocumentRef.энргОперацияСПриборомУчета</v8:Type>
						<v8:Type>cfg:DocumentRef.энргПлатежноеПоручениеВходящие</v8:Type>
						<v8:Type>cfg:DocumentRef.энргОбходнойЛист</v8:Type>
						<v8:Type>cfg:DocumentRef.энргПриходныйКассовыйОрдер</v8:Type>
						<v8:Type>cfg:DocumentRef.энргПоступлениеОплатыЧерезКонтроллера</v8:Type>
						<v8:Type>cfg:DocumentRef.энргРегистрацияПоказанийАбонента</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаДокументаОснования</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭтоСторно</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Район</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргЗоныОтвественности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЧастныйСектор</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Строение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргСтроения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Помещение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргПомещения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Абонент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргАбоненты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПериодНачисления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТочкаУчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргТочкиУчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Услуга</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргВидыУслуг</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НаправлениеИспользованияТУ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргНаправлениеИспользованияТочекУчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЗначениеТарифа</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПриборУчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргПриборыУчетаАбонента</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Шкала</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргШкалыПриборовУчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТарифнаяЗона</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргТарифныеЗоны</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДиапазонДифференцированногоТарифа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргДиапазоныДифференцированныхТарифов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Поставщик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргКонтрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЗависимаяТочкаУчета</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПриборЗависимой</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргПриборыУчетаАбонента</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СпособНачисления</Name>
					<Type>
						<v8:Type>cfg:EnumRef.энргСпособНачислений</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СверхНорматива</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТарифнаяГруппа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргГруппыПотребителей</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидБлагоустройства</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргВидыБлагоустройств</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НормаПотребления</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>6</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

cf_billing/InformationRegisters/энргРодительТочкиУчета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>энргРодительТочкиУчета</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>РодительТочкиУчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргТочкиУчета</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ПериодРегистрации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодНачисления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Район</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргЗоныОтвественности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КлючПомещения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргКлючиПомещений</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТочкаУчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргТочкиУчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cf_billing/InformationRegisters/энргУслугиТочекУчета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>энргУслугиТочекУчета</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Услуга</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргВидыУслуг</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Техническая</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ПериодНачисления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодРегистрации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Район</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргЗоныОтвественности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КлючПомещения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргКлючиПомещений</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТочкаУчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргТочкиУчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УдалитьАбонент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргАбоненты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cf_billing/Enums/энргВидыНачислений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>энргВидыНачислений</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Начисление</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Перерасчет</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НачислениеОДН</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

cf_billing/DataProcessors/энргПерерасчетМенеджер/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

Функция ДанныеНачисленийЗаПериод(Знач Организация,Знач Район,Знач ПериодНачисления, Знач НачПериода,Знач КонПериода,Знач тзРасшифровка, Знач тзПомещения, Ссылка = Неопределено) Экспорт 
		
	ПараметрыЗапроса 	= Новый Структура;
	ПараметрыЗапроса.Вставить("Организация"		, Организация);
	ПараметрыЗапроса.Вставить("Распределение"	, Ложь);
	ПараметрыЗапроса.Вставить("Район"			, Район);
	ПараметрыЗапроса.Вставить("НачалоПериода"	, НачПериода);
	//ПараметрыЗапроса.Вставить("КонецПериода", 	?(НачалоМесяца(КонПериода) = ПериодНачисления,НачалоМесяца(КонПериода)-1,КонецМесяца(КонПериода))); Было
	ПараметрыЗапроса.Вставить("КонецПериода"	, КонПериода);
	ПараметрыЗапроса.Вставить("Расшифровка"		, тзРасшифровка); 	
	ПараметрыЗапроса.Вставить("КлючиПомещений"	, тзПомещения.ВыгрузитьКолонку("КлючПомещения"));
	ПараметрыЗапроса.Вставить("Регистратор"		, Ссылка);
	
	ПараметрыСхемы 		= Новый Структура;
	ПараметрыВТ 		= Новый Массив;
	ПараметрыВТ.Добавить(энргФормированиеТекстовЗапроса.ПараметрТипРавно(Новый Структура("Организация,Район,Распределение","Организация","Район","Распределение")));
	ПараметрыВТ.Добавить(энргФормированиеТекстовЗапроса.ПараметрПериодМежду("Период", Новый Структура("НачалоПериода,КонецПериода","НачалоПериода","КонецПериода")));
	//ПараметрыВТ.Добавить(энргФормированиеТекстовЗапроса.ПараметрПериодМежду("ПериодНачисления", Новый Структура("НачалоПериода,КонецПериода","НачалоПериода","КонецПериода")));
	//ПараметрыВТ.Добавить(энргФормированиеТекстовЗапроса.ПараметрТипМеньшеРавно(Новый Структура("ПериодНачисления","КонецПериода")));

	ПараметрыВТ.Добавить(энргФормированиеТекстовЗапроса.ПараметрТипВСписке(Новый Структура("КлючПомещения","КлючиПомещений")));
	Если Ссылка <> Неопределено Тогда
		ПараметрыВТ.Добавить(энргФормированиеТекстовЗапроса.ПараметрТипНеРавно(Новый Структура("Регистратор","Регистратор")));
	КонецЕсли;
	ПараметрыСхемы.Вставить("ПараметрыВТ", ПараметрыВТ);
	
	Схема 				= Неопределено;
	РегистрыНакопления.энргОбъемНачислений.ЗаполнитьСхемуНаборомЗаписейПоКлючуПомещения(Схема,ПараметрыСхемы, "НаборЗаписейПоОрганизации"); 
	  	
	ПараметрыСхемы 		= Новый Структура;
	ПараметрыВТ 		= Новый Массив;
	ПараметрыВТ.Добавить(энргФормированиеТекстовЗапроса.ПараметрТипРавно(Новый Структура("Район,Распределение","Район","Распределение")));
	ПараметрыВТ.Добавить(энргФормированиеТекстовЗапроса.ПараметрПериодМежду("Период", Новый Структура("НачалоПериода,КонецПериода","НачалоПериода","КонецПериода")));
	//ПараметрыВТ.Добавить(энргФормированиеТекстовЗапроса.ПараметрПериодМежду("ПериодНачисления", Новый Структура("НачалоПериода,КонецПериода","НачалоПериода","КонецПериода")));
	//ПараметрыВТ.Добавить(энргФормированиеТекстовЗапроса.ПараметрТипМеньшеРавно(Новый Структура("ПериодНачисления","КонецПериода")));
	ПараметрыВТ.Добавить(энргФормированиеТекстовЗапроса.ПараметрТипВСписке(Новый Структура("КлючПомещения","КлючиПомещений")));
	Если Ссылка <> Неопределено Тогда
		ПараметрыВТ.Добавить(энргФормированиеТекстовЗапроса.ПараметрТипНеРавно(Новый Структура("Регистратор","Регистратор")));
	КонецЕсли;
	ПараметрыСхемы.Вставить("ПараметрыВТ", ПараметрыВТ);
	РегистрыНакопления.энргОбъемНачислений.ЗаполнитьСхемуНаборомЗаписейПоКлючуПомещения(Схема,ПараметрыСхемы, "НаборЗаписейБезОрганизации");
		
	ЗаполнитьСхемуДанныеРасшифровки(Схема,"Расшифровка");
	ЗаполнитьСхемуУслугиТочекДругихОрганизаций(Схема,"НачислениеПоПлательщикам");
	Пакет 				= Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));
	Пакет.УстановитьТекстЗапроса(ТекстЗапросаДанныеНачисленийЗаПериод());
		
	Возврат энргСхемаЗапросаСервер.ВыполнитьЗапрос(Схема, ПараметрыЗапроса);	
	
КонецФункции

Функция ДанныеРаспределенияЗаПериод(Знач Организация,Знач Район,Знач ПериодНачисления, Знач НачПериода,Знач КонПериода, Знач тзПомещения, АбонентСтарый) Экспорт 
	
	ПараметрыЗапроса 	= Новый Структура;
	ПараметрыЗапроса.Вставить("Организация"		, Организация);
	ПараметрыЗапроса.Вставить("Распределение"	, Истина);
	ПараметрыЗапроса.Вставить("Район"			, Район);
	ПараметрыЗапроса.Вставить("НачалоПериода"	, НачПериода);
	ПараметрыЗапроса.Вставить("КонецПериода"	, КонПериода);
	ПараметрыЗапроса.Вставить("КлючиПомещений"	, тзПомещения.ВыгрузитьКолонку("КлючПомещения"));
	ПараметрыЗапроса.Вставить("Абоненты"		, АбонентСтарый);
	
	ПараметрыСхемы 		= Новый Структура;
	ПараметрыВТ 		= Новый Массив;
	ПараметрыВТ.Добавить(энргФормированиеТекстовЗапроса.ПараметрТипРавно(Новый Структура("Организация,Район,Распределение","Организация","Район","Распределение")));
	ПараметрыВТ.Добавить(энргФормированиеТекстовЗапроса.ПараметрПериодМежду("Период", Новый Структура("НачалоПериода,КонецПериода","НачалоПериода","КонецПериода")));
	ПараметрыВТ.Добавить(энргФормированиеТекстовЗапроса.ПараметрТипВСписке(Новый Структура("КлючПомещения","КлючиПомещений")));
	ПараметрыВТ.Добавить(энргФормированиеТекстовЗапроса.ПараметрТипВСписке(Новый Структура("Абонент","Абоненты")));
	ПараметрыСхемы.Вставить("ПараметрыВТ", ПараметрыВТ);
	
	Схема 				= Неопределено;
	РегистрыНакопления.энргОбъемНачислений.ЗаполнитьСхемуНаборомЗаписейРаспределенияПоКлючуПомещения(Схема,ПараметрыСхемы, "НаборЗаписейПоРаспределению"); 
	  	
	Пакет 				= Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));
	Пакет.УстановитьТекстЗапроса(ТекстЗапросаДанныеРаспределенияЗаПериод());
		
	Возврат энргСхемаЗапросаСервер.ВыполнитьЗапрос(Схема, ПараметрыЗапроса);	
	
КонецФункции

Функция ДанныеНачисленныйСреднийЗаПериод(Знач Организация,Знач Район, Знач ПериодНачисления, Знач НачПериода,Знач КонПериода, Знач тзПомещения, Ссылка = Неопределено) Экспорт 
	ПараметрыЗапроса  		= Новый Структура;
	ПараметрыЗапроса.Вставить("Организация"		, Организация);
	ПараметрыЗапроса.Вставить("Район"			, Район);
	ПараметрыЗапроса.Вставить("КлючиПомещений"	, тзПомещения.ВыгрузитьКолонку("КлючПомещения"));
	ПараметрыЗапроса.Вставить("НачалоПериода"	, НачПериода);
	//ПараметрыЗапроса.Вставить("КонецПериода", 	?(НачалоМесяца(КонПериода) = ПериодНачисления,НачалоМесяца(КонПериода)-1,КонецМесяца(КонПериода))); Было
	ПараметрыЗапроса.Вставить("КонецПериода"	, КонПериода);
	ПараметрыЗапроса.Вставить("Регистратор"		, Ссылка);
	
	ПараметрыСхемы 		= Новый Структура;
	ПараметрыВТ 		= Новый Массив;
	ПараметрыВТ.Добавить(энргФормированиеТекстовЗапроса.ПараметрТипРавно(Новый Структура("Организация,Район,Распределение","Организация","Район","Распределение")));
	ПараметрыВТ.Добавить(энргФормированиеТекстовЗапроса.ПараметрПериодМежду("Период", Новый Структура("НачалоПериода,КонецПериода","НачалоПериода","КонецПериода")));
	ПараметрыВТ.Добавить(энргФормированиеТекстовЗапроса.ПараметрТипВСписке(Новый Структура("КлючПомещения","КлючиПомещений")));
	Если Ссылка <> Неопределено Тогда
		ПараметрыВТ.Добавить(энргФормированиеТекстовЗапроса.ПараметрТипНеРавно(Новый Структура("Регистратор","Регистратор")));
	КонецЕсли;
	ПараметрыСхемы.Вставить("ПараметрыВТ", ПараметрыВТ);
	
	Схема 			= Неопределено;
	РегистрыНакопления.энргНачисленныйСреднийОбъем.ЗаполнитьСхемуНаборомЗаписейПоКлючуПомещения(Схема,ПараметрыСхемы, "ДействующиеТочки");
	ПараметрыВТ 		= Новый Массив;
	ПараметрыВТ.Добавить(энргФормированиеТекстовЗапроса.ПараметрТипРавно(Новый Структура("Период","КонецПериода")));
	ПараметрыСхемы.Вставить("ПараметрыВТ", ПараметрыВТ);
	РегистрыСведений.энргРодительТочкиУчета.АктуальныеРодителиТочекУчета(Схема,ПараметрыСхемы, "РодителиТУ");
	
	Пакет 						= Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));
	Пакет.УстановитьТекстЗапроса(ТекстЗапросаДанныеНачисленныйСреднийЗаПериод());
	
	Возврат энргСхемаЗапросаСервер.ВыполнитьЗапрос(Схема,ПараметрыЗапроса);
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ЗаполнитьСхемуДанныеРасшифровки(Схема, ТаблицаДляПомещения)
	
	Если Схема = Неопределено Тогда
		Схема  						= Новый СхемаЗапроса;
		Пакет 						= Схема.ПакетЗапросов[0];
	Иначе
		Пакет 						= Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));	
	КонецЕсли;
	
	Пакет.УстановитьТекстЗапроса(ТекстЗапросаРасшифровкаНачислений());
	Пакет.ТаблицаДляПомещения 		= ТаблицаДляПомещения; 
	
КонецПроцедуры

Процедура ЗаполнитьСхемуУслугиТочекДругихОрганизаций(Схема, ТаблицаДляПомещения)
	
	Если Схема = Неопределено Тогда
		Схема  						= Новый СхемаЗапроса;
		Пакет 						= Схема.ПакетЗапросов[0];
	Иначе
		Пакет 						= Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));	
	КонецЕсли;
	
	Пакет.УстановитьТекстЗапроса(ТекстЗапросаУслугиТочекДругихОрганизаций());
	Пакет.ТаблицаДляПомещения 		= ТаблицаДляПомещения; 
	
КонецПроцедуры

Функция ТекстЗапросаРасшифровкаНачислений()
	
	Текст = 
	"ВЫБРАТЬ
	|	Расшифровка.ТочкаУчета КАК ТочкаУчета,
	|	Расшифровка.Организация КАК Организация,
	|	Расшифровка.Услуга КАК Услуга
	|ИЗ
	|	&Расшифровка КАК Расшифровка";
	
	Возврат Текст;
	
КонецФункции

Функция ТекстЗапросаУслугиТочекДругихОрганизаций()
	
	Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Расшифровка.ТочкаУчета КАК ТочкаУчета,
	|	Расшифровка.Организация КАК Организация,
	|	Расшифровка.Услуга КАК Услуга	
	|ИЗ
	|	Расшифровка КАК Расшифровка
	|ГДЕ
	|	Расшифровка.Организация <> &Организация";
	
	Возврат Текст;
	
КонецФункции

Функция ТекстЗапросаДанныеНачисленийЗаПериод()
	
	Текст 	=
	"ВЫБРАТЬ
	|	НаборЗаписейПоОрганизации.*
	|ИЗ
	|	НаборЗаписейПоОрганизации КАК НаборЗаписейПоОрганизации
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	НаборЗаписейБезОрганизации.*
	|ИЗ
	|	НаборЗаписейБезОрганизации КАК НаборЗаписейБезОрганизации
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ НачислениеПоПлательщикам КАК НачислениеПоПлательщикам
	|		ПО НаборЗаписейБезОрганизации.Услуга = НачислениеПоПлательщикам.Услуга
	|			И НаборЗаписейБезОрганизации.Организация = НачислениеПоПлательщикам.Организация
	|			И НаборЗаписейБезОрганизации.ТочкаУчета = НачислениеПоПлательщикам.ТочкаУчета
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	энргОбъемНачислений.Период КАК Период,
	|	энргОбъемНачислений.Регистратор КАК Регистратор,
	|	энргОбъемНачислений.НомерСтроки КАК НомерСтроки,
	|	энргОбъемНачислений.Активность КАК Активность,
	|	энргОбъемНачислений.Организация КАК Организация,
	|	энргОбъемНачислений.Район КАК Район,
	|	энргОбъемНачислений.Распределение КАК Распределение,
	|	энргОбъемНачислений.Строение КАК Строение,
	|	энргОбъемНачислений.Помещение КАК Помещение,
	|	энргОбъемНачислений.КлючПомещения КАК КлючПомещения,
	|	энргОбъемНачислений.Абонент КАК Абонент,
	|	энргОбъемНачислений.Услуга КАК Услуга,
	|	энргОбъемНачислений.ТочкаУчета КАК ТочкаУчета,
	|	энргОбъемНачислений.ВидНачисления КАК ВидНачисления,
	|	энргОбъемНачислений.СпособНачисления КАК СпособНачисления,
	|	энргОбъемНачислений.НаправлениеИспользованияТУ КАК НаправлениеИспользованияТУ,
	|	энргОбъемНачислений.Измеритель КАК Измеритель,
	|	энргОбъемНачислений.ПриборУчета КАК ПриборУчета,
	|	энргОбъемНачислений.Шкала КАК Шкала,
	|	энргОбъемНачислений.ТарифнаяЗона КАК ТарифнаяЗона,
	|	энргОбъемНачислений.ЗначениеТарифа КАК ЗначениеТарифа,
	|	энргОбъемНачислений.Поставщик КАК Поставщик,
	|	энргОбъемНачислений.ПериодРасчета КАК ПериодРасчета,
	|	энргОбъемНачислений.ПериодНачисления КАК ПериодНачисления,
	|	энргОбъемНачислений.ЧастныйСектор КАК ЧастныйСектор,
	|	энргОбъемНачислений.СверхНорматива КАК СверхНорматива,
	|	энргОбъемНачислений.НеПрименятьСезонность КАК НеПрименятьСезонность,
	|	энргОбъемНачислений.БылУстановленныйПриборВЭтомГоду КАК БылУстановленныйПриборВЭтомГоду,
	|	энргОбъемНачислений.ОбъемУслуги КАК ОбъемУслуги,
	|	энргОбъемНачислений.ОбъемУслугиПотери КАК ОбъемУслугиПотери,
	|	энргОбъемНачислений.ОбъемУслугиПотребленный КАК ОбъемУслугиПотребленный,
	|	энргОбъемНачислений.ОбъемУслугиПотребленныйПотери КАК ОбъемУслугиПотребленныйПотери,
	|	энргОбъемНачислений.ОбъемУслугиПотребленныйСоцНорма КАК ОбъемУслугиПотребленныйСоцНорма,
	|	энргОбъемНачислений.ОбъемУслугиСоцНорма КАК ОбъемУслугиСоцНорма,
	|	энргОбъемНачислений.Сумма КАК Сумма,
	|	энргОбъемНачислений.СуммаПоПовышенномуКоэффициенту КАК СуммаПоПовышенномуКоэффициенту,
	|	энргОбъемНачислений.СуммаСниженияСтоимости КАК СуммаСниженияСтоимости,
	|	энргОбъемНачислений.ВидБлагоустройства КАК ВидБлагоустройства,
	|	энргОбъемНачислений.ВидДифференцированности КАК ВидДифференцированности,
	|	энргОбъемНачислений.ВидПлощади КАК ВидПлощади,
	|	энргОбъемНачислений.ДатаПоверки КАК ДатаПоверки,
	|	энргОбъемНачислений.ДопСоциальнаяНормаПотребления КАК ДопСоциальнаяНормаПотребления,
	|	энргОбъемНачислений.ЕстьСреднийПоВсемТочкамУслуги КАК ЕстьСреднийПоВсемТочкамУслуги,
	|	энргОбъемНачислений.ЗависимаяТочкаУчета КАК ЗависимаяТочкаУчета,
	|	энргОбъемНачислений.ВладелецЗависимойТочкиУчета КАК ВладелецЗависимойТочкиУчета,
	|	энргОбъемНачислений.ЗависитОтУслуги КАК ЗависитОтУслуги,
	|	энргОбъемНачислений.ЗначениеПлощади КАК ЗначениеПлощади,
	|	энргОбъемНачислений.ЗначениеСоциальнойНормы КАК ЗначениеСоциальнойНормы,
	|	энргОбъемНачислений.ЗначениеСоциальнойНормыРасчетныйСпособ КАК ЗначениеСоциальнойНормыРасчетныйСпособ,
	|	энргОбъемНачислений.ЗначениеТарифаРЭК КАК ЗначениеТарифаРЭК,
	|	энргОбъемНачислений.ЗначениеТарифаСверхНорматива КАК ЗначениеТарифаСверхНорматива,
	|	энргОбъемНачислений.ИспользоватьКоэффициентСдерживанияРостаПлаты КАК ИспользоватьКоэффициентСдерживанияРостаПлаты,
	|	энргОбъемНачислений.КлючНорматива КАК КлючНорматива,
	|	энргОбъемНачислений.КлючСоцНорматива КАК КлючСоцНорматива,
	|	энргОбъемНачислений.КоличествоИзмеретелейНаправления КАК КоличествоИзмеретелейНаправления,
	|	энргОбъемНачислений.КоличествоКомнат КАК КоличествоКомнат,
	|	энргОбъемНачислений.КоличествоПроживающих КАК КоличествоПроживающих,
	|	энргОбъемНачислений.КоличествоПрописанных КАК КоличествоПрописанных,
	|	энргОбъемНачислений.КоличествоСобственников КАК КоличествоСобственников,
	|	энргОбъемНачислений.КонецПериода КАК КонецПериода,
	|	энргОбъемНачислений.КонечныеПоказания КАК КонечныеПоказания,
	|	энргОбъемНачислений.КоэффициентНорматива КАК КоэффициентНорматива,
	|	энргОбъемНачислений.КоэффициентНормативаНеПрименятьСезонность КАК КоэффициентНормативаНеПрименятьСезонность,
	|	энргОбъемНачислений.КоэффициентПУ КАК КоэффициентПУ,
	|	энргОбъемНачислений.КоэффициентРаспределенияОстатка КАК КоэффициентРаспределенияОстатка,
	|	энргОбъемНачислений.КоэффициентСезоности КАК КоэффициентСезоности,
	|	энргОбъемНачислений.КоэффициентФормула КАК КоэффициентФормула,
	|	энргОбъемНачислений.НачалоПериода КАК НачалоПериода,
	|	энргОбъемНачислений.НачальныеПоказания КАК НачальныеПоказания,
	|	энргОбъемНачислений.НормаПотребления КАК НормаПотребления,
	|	энргОбъемНачислений.ОснованиеПерерасчета КАК ОснованиеПерерасчета,
	|	энргОбъемНачислений.ОснованиеПерерасчетаДата КАК ОснованиеПерерасчетаДата,
	|	энргОбъемНачислений.ОтключатьВНеполивнойСезон КАК ОтключатьВНеполивнойСезон,
	|	энргОбъемНачислений.ПлощадьАбонентов КАК ПлощадьАбонентов,
	|	энргОбъемНачислений.ПлощадьМОП КАК ПлощадьМОП,
	|	энргОбъемНачислений.ПлощадьСобственнаяПоставка КАК ПлощадьСобственнаяПоставка,
	|	энргОбъемНачислений.ПовыщающийКоэффициент КАК ПовыщающийКоэффициент,
	|	энргОбъемНачислений.ПомещениеРодитель КАК ПомещениеРодитель,
	|	энргОбъемНачислений.ПриборЗависимой КАК ПриборЗависимой,
	|	энргОбъемНачислений.РасчетПоФормуле КАК РасчетПоФормуле,
	|	энргОбъемНачислений.СниматьНачисленныйСредний КАК СниматьНачисленныйСредний,
	|	энргОбъемНачислений.СниматьНачисленныйСреднийЗависимыхТочек КАК СниматьНачисленныйСреднийЗависимыхТочек,
	|	энргОбъемНачислений.СниматьНачисленныйСреднийПоФормулам КАК СниматьНачисленныйСреднийПоФормулам,
	|	энргОбъемНачислений.СоставнаяУслуга КАК СоставнаяУслуга,
	|	энргОбъемНачислений.СоциальнаяНормаПотребления КАК СоциальнаяНормаПотребления,
	|	энргОбъемНачислений.СписатьИзНормы КАК СписатьИзНормы,
	|	энргОбъемНачислений.ТарифнаяГруппа КАК ТарифнаяГруппа,
	|	энргОбъемНачислений.Техническая КАК Техническая,
	|	энргОбъемНачислений.ТочкаУчетаРодитель КАК ТочкаУчетаРодитель,
	|	энргОбъемНачислений.УдалитьКлючПомещения КАК УдалитьКлючПомещения,
	|	энргОбъемНачислений.УдалитьНеПрименятьСезонность КАК УдалитьНеПрименятьСезонность,
	|	энргОбъемНачислений.ФизЛицо КАК ФизЛицо,
	|	энргОбъемНачислений.ПотериОбъем КАК ПотериОбъем,
	|	энргОбъемНачислений.ПотериПроцент КАК ПотериПроцент,
	|	энргОбъемНачислений.СрокПоверкиИстек КАК СрокПоверкиИстек,
	|	энргОбъемНачислений.ПроцентСниженияСтоимости КАК ПроцентСниженияСтоимости,
	|	энргОбъемНачислений.УслугаПолностьюОприборена КАК УслугаПолностьюОприборена,
	|	энргОбъемНачислений.ПоставщикиНеНачислять КАК ПоставщикиНеНачислять,
	|	энргОбъемНачислений.УслугаОграничена КАК УслугаОграничена,
	|	энргОбъемНачислений.ЭтоСторно КАК ЭтоСторно,
	|	энргОбъемНачислений.НомерСторнируемойСтроки КАК НомерСторнируемойСтроки,
	|	энргОбъемНачислений.ДоговорЗаключенДоТП КАК ДоговорЗаключенДоТП,
	|	энргОбъемНачислений.КоличествоДнейИспользованияУслуги КАК КоличествоДнейИспользованияУслуги,
	|	энргОбъемНачислений.ОбъемУслугиТехнический КАК ОбъемУслугиТехнический,
	|	энргОбъемНачислений.ЭтоОбъемПотребленный КАК ЭтоОбъемПотребленный
	|ИЗ
	|	РегистрНакопления.энргОбъемНачислений КАК энргОбъемНачислений
	|		
	|ГДЕ
	|	энргОбъемНачислений.Регистратор ССЫЛКА Документ.энргПерерасчет
	|	И энргОбъемНачислений.Организация = &Организация
	|	И энргОбъемНачислений.Район = &Район
	|	И энргОбъемНачислений.Распределение = &Распределение
	|	И (энргОбъемНачислений.Период < &НачалоПериода)
	//|			ИЛИ ОбъемНачислений.Период > &КонецПериода)
	|	И энргОбъемНачислений.КлючПомещения В(&КлючиПомещений)
	|	И энргОбъемНачислений.ПериодНачисления МЕЖДУ &НачалоПериода И &КонецПериода
	|	И энргОбъемНачислений.ВидНачисления = ЗНАЧЕНИЕ(Перечисление.энргВидыНачислений.Перерасчет)";
	Возврат Текст;

КонецФункции

Функция ТекстЗапросаДанныеРаспределенияЗаПериод()
	
	Текст 	=
	"ВЫБРАТЬ
	|	НаборЗаписейПоРаспределению.*
	|ИЗ
	|	НаборЗаписейПоРаспределению КАК НаборЗаписейПоРаспределению
	|";
	Возврат Текст;

КонецФункции

Функция ТекстЗапросаДанныеНачисленныйСреднийЗаПериод()
	
	Текст 	=
	"ВЫБРАТЬ
	|	ДействующиеТочки.*,
	|	ЕСТЬNULL(РодителиТУ.РодительТочкиУчета,ДействующиеТочки.ТочкаУчета) КАК ТочкаУчетаСУчетомРодителя,
	|	ВЫБОР
	|		КОГДА энргУслугиТочекУчетаСрезПоследних.Услуга.СоставнаяУслуга
	|			ТОГДА энргУслугиТочекУчетаСрезПоследних.Услуга
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.энргВидыУслуг.ПустаяСсылка)
	|	КОНЕЦ КАК СоставнаяУслуга
	|ИЗ
	|	ДействующиеТочки КАК ДействующиеТочки
	|		ЛЕВОЕ СОЕДИНЕНИЕ РодителиТУ КАК РодителиТУ
	|		ПО ДействующиеТочки.ТочкаУчета = РодителиТУ.ТочкаУчета 
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.энргУслугиТочекУчета.СрезПоследних(
	|				&КонецПериода,
	|				(Организация, Район, КлючПомещения, ТочкаУчета) В
	|					(ВЫБРАТЬ
	|						ВТ.Организация,
	|						ВТ.Район,
	|						ВТ.КлючПомещения,
	|						ВТ.ТочкаУчета
	|					ИЗ
	|						ДействующиеТочки КАК ВТ)) КАК энргУслугиТочекУчетаСрезПоследних 
	|		ПО ДействующиеТочки.ТочкаУчета = энргУслугиТочекУчетаСрезПоследних.ТочкаУчета";
	Возврат Текст;

КонецФункции

#КонецОбласти

#КонецЕсли
